Revit 2024 API
ParameterTypeId.LegendComponentDetailLevel Property
 "Detail Level"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId LegendComponentDetailLevel { get; }
Visual Basic
Public Shared ReadOnly Property LegendComponentDetailLevel As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LegendComponentDetailLevel {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace